In [7]:

employees = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Daniela', 'Eduardo', 'Fernanda', 'Gustavo', 'Heloísa'],
    'Idade': [25, 30, 28, 35, 40, 22, 27, 33],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba', 'São Paulo', 'Rio de Janeiro', 'Curitiba', 'Belo Horizonte'],
    'Salário': [3500, 4200, 3900, 4500, 7000, 3200, 4100, 3800],
    'Setor': ['TI', 'Financeiro', 'TI', 'RH', 'Diretoria', 'Financeiro', 'TI', 'RH']
}

df = pd.DataFrame(employees)
df.to_csv('employees.csv', sep=',', index=False)

In [8]:
#Import database
data = pd.read_csv('employees.csv', sep=',')
print(data)

       Nome  Idade          Cidade  Salário       Setor
0       Ana     25       São Paulo     3500          TI
1     Bruno     30  Rio de Janeiro     4200  Financeiro
2    Carlos     28  Belo Horizonte     3900          TI
3   Daniela     35        Curitiba     4500          RH
4   Eduardo     40       São Paulo     7000   Diretoria
5  Fernanda     22  Rio de Janeiro     3200  Financeiro
6   Gustavo     27        Curitiba     4100          TI
7   Heloísa     33  Belo Horizonte     3800          RH

In [9]:
#INFOS:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     8 non-null      object
 1   Idade    8 non-null      int64
 2   Cidade   8 non-null      object
 3   Salário  8 non-null      int64
 4   Setor    8 non-null      object
dtypes: int64(2), object(3)
memory usage: 452.0+ bytes
None

In [10]:
print('MEDIA SALARIAL POR SETOR')
media_setor = data.groupby('Setor')['Salário'].mean().sort_values(ascending=False)
print(media_setor)

MEDIA SALARIAL POR SETOR
Setor
Diretoria     7000.000000
RH            4150.000000
TI            3833.333333
Financeiro    3700.000000
Name: Salário, dtype: float64

In [11]:
print('Quantidade de funcionarios por cidade')
dd = data.groupby('Cidade')['Cidade'].count()
print(dd)

Quantidade de funcionarios por cidade
Cidade
Belo Horizonte    2
Curitiba          2
Rio de Janeiro    2
São Paulo         2
Name: Cidade, dtype: int64

In [12]:
print('Pessoa com maior salario')
maior_salario = data.groupby('Nome')['Salário'].max().sort_values(ascending=False)
print(maior_salario)

Pessoa com maior salario
Nome
Eduardo     7000
Daniela     4500
Bruno       4200
Gustavo     4100
Carlos      3900
Heloísa     3800
Ana         3500
Fernanda    3200
Name: Salário, dtype: int64

In [13]:
especific = data.loc[data.groupby('Nome')['Salário'].idxmax()].sort_values('Salário', ascending=False).iloc[0]
print(especific)

Nome         Eduardo
Idade             40
Cidade     São Paulo
Salário         7000
Setor      Diretoria
Name: 4, dtype: object

In [14]:
print('Criando coluna de imposto')
data['Imposto'] = data['Salário'] * 0.15 
data['Salário_Imposto'] = data['Imposto'] + data['Salário']
print(data.to_string())  # Exibe o DataFrame inteiro sem limitações

Criando coluna de imposto
       Nome  Idade          Cidade  Salário       Setor  Imposto  Salário_Imposto
0       Ana     25       São Paulo     3500          TI    525.0           4025.0
1     Bruno     30  Rio de Janeiro     4200  Financeiro    630.0           4830.0
2    Carlos     28  Belo Horizonte     3900          TI    585.0           4485.0
3   Daniela     35        Curitiba     4500          RH    675.0           5175.0
4   Eduardo     40       São Paulo     7000   Diretoria   1050.0           8050.0
5  Fernanda     22  Rio de Janeiro     3200  Financeiro    480.0           3680.0
6   Gustavo     27        Curitiba     4100          TI    615.0           4715.0
7   Heloísa     33  Belo Horizonte     3800          RH    570.0           4370.0

In [27]:
from IPython.display import display
display(data)

,Nome,Idade,Cidade,Salário,Setor,Imposto,Salário_Imposto
0,Ana,25,São Paulo,3500,TI,525.0,4025.0
1,Bruno,30,Rio de Janeiro,4200,Financeiro,630.0,4830.0
2,Carlos,28,Belo Horizonte,3900,TI,585.0,4485.0
3,Daniela,35,Curitiba,4500,RH,675.0,5175.0
4,Eduardo,40,São Paulo,7000,Diretoria,1050.0,8050.0
5,Fernanda,22,Rio de Janeiro,3200,Financeiro,480.0,3680.0
6,Gustavo,27,Curitiba,4100,TI,615.0,4715.0
7,Heloísa,33,Belo Horizonte,3800,RH,570.0,4370.0